USER_DOES_NOT_EXIST = 'Пользователь не найден.'
DOMAIN_DOES_NOT_EXIST = 'Почтовый сервис не найден.'
USER_ALREADY_EXIST = 'Пользователь уже существует.'
BOX_ALREADY_EXIST = 'Почтовый ящик уже существует.'
BOX_DOES_NOT_EXIST = 'Почтовый ящик не найден.'
IMAP_AUTHENTICATION_FAILED = (
    'Не удалось выполнить аутентификацию. Некорректные логин-пароль или'
    ' недоступен IMAP протокол.'
)
IMAP_CONNECTION_ERROR = (
    'Не удалось соединиться с почтовым ящиком. Проверьте настройки почты.'
)
SERVER_UNAVAILABLE = 'Сервер недоступен. Попробуйте позже.'
